Tekla Open API Reference for Tekla Structures 2025
PourAttributes Constructor
Overload List
Name | Description
PourObject.PourAttributes()
 Creates a new default pour attributes instance that loads standard attributes.
PourObject.PourAttributes(String)
 Creates a new pour attributes instance that loads the specified attributes.
Top
See Also
Reference
PourObject.PourAttributes Class
Tekla.Structures.Drawing Namespace